In [1]:
import pandas as pd

In [2]:
companies ={
    'value': [220,160,140,117,94],
    'Change': [17.5,11.9,-8.5,-2.1,3.5],
    'Sector': ['Retail', 'Tech', 'Tech', 'Tech', 'Tech']
}

data = pd.DataFrame(companies, index=['Amazon', 'Google', 'Apple', 'Microsoft', 'Samsung'])
data

           value  Change  Sector
Amazon       220    17.5  Retail
Google       160    11.9    Tech
Apple        140    -8.5    Tech
Microsoft    117    -2.1    Tech
Samsung       94     3.5    Tech

In [3]:
#get info using built in funcs
data.info()
data.columns
data.index
data.describe() #brief stats

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Amazon to Samsung
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   value   5 non-null      int64
 1   Change  5 non-null      float64
 2   Sector  5 non-null      object
dtypes: float64(1), int64(1), object(1)
memory usage: 160.0+ bytes

            value     Change
count    5.000000   5.000000
mean   146.200000   4.460000
std     48.095738  10.456003
min     94.000000  -8.500000
25%    117.000000  -2.100000
50%    140.000000   3.500000
75%    160.000000  11.900000
max    220.000000  17.500000

In [4]:
data.loc[data['value'] > 150] #filter val in Values greater than 150

        value  Change  Sector
Amazon    220    17.5  Retail
Google    160    11.9    Tech

In [5]:
data['Change']

Amazon       17.5
Google       11.9
Apple        -8.5
Microsoft    -2.1
Samsung       3.5
Name: Change, dtype: float64

In [6]:
#slicing
data.iloc[3] #index

value      117
Change    -2.1
Sector    Tech
Name: Microsoft, dtype: object

In [7]:
data.iloc[1:4, 1:3] # [row:row][col:col]

           Change Sector
Google       11.9   Tech
Apple        -8.5   Tech
Microsoft    -2.1   Tech

In [8]:
data[0:3]

        value  Change  Sector
Amazon    220    17.5  Retail
Google    160    11.9    Tech
Apple     140    -8.5    Tech

In [9]:
data['Amazon':'Microsoft']

           value  Change  Sector
Amazon       220    17.5  Retail
Google       160    11.9    Tech
Apple        140    -8.5    Tech
Microsoft    117    -2.1    Tech

In [10]:
#Arithmetic
data['value'].mul(2) #mul all val in Values by 2
data['value'].sub(2) #sub all val in Values by 2
data['value'].add(2) #add all val in Values by 2

Amazon       222
Google       162
Apple        142
Microsoft    119
Samsung       96
Name: value, dtype: int64

In [15]:
div, rem = divmod(data['value'],2) #div then mod val in Values by 2
div, rem

(Amazon       110
 Google        80
 Apple         70
 Microsoft     58
 Samsung       47
 Name: value, dtype: int64,
 Amazon       0
 Google       0
 Apple        0
 Microsoft    1
 Samsung      0
 Name: value, dtype: int64)

In [16]:
#descriptive 
data.mean()

value     146.20
Change      4.46
dtype: float64

In [17]:
data.sum(0) #sum of each col, default is 0

value                        731
Change                      22.3
Sector    RetailTechTechTechTech
dtype: object

In [18]:
data.sum(1) #by index

Amazon       237.5
Google       171.9
Apple        131.5
Microsoft    114.9
Samsung       97.5
dtype: float64

In [20]:
data

           value  Change  Sector
Amazon       220    17.5  Retail
Google       160    11.9    Tech
Apple        140    -8.5    Tech
Microsoft    117    -2.1    Tech
Samsung       94     3.5    Tech

In [19]:
data.std() #standard deviation

value     48.095738
Change    10.456003
dtype: float64

In [21]:
data.quantile(.5) #quantile by first 50%

value     140.0
Change      3.5
Name: 0.5, dtype: float64

In [ ]:
data.min()
data.cumsum()
data.count() #count non-null vals